#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/businesscompanyllc/businesscompanyllc-github/runs/run-nG3qzZyQbRd7mbKm

Waiting for the plan to start...

Terraform v1.0.10
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.repo_github_configuration.github_repository.the_repository: Refreshing state... [id=github-configuration]
github_membership.user_1: Refreshing state... [id=businesscompanyllc:sarina]
github_membership.user_0: Refreshing state... [id=businesscompanyllc:kdmccormick]
github_team.organization_managers: Refreshing state... [id=5308184]
github_team_membership.membership_for_user_1: Refreshing state... [id=5308184:sarina]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.repo_core_platform.github_branch.default will be created
  + resource "github_branch" "default" {
      + branch        = "master"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "core-platform"
      + sha           = (known after apply)
      + source_branch = "master"
      + source_sha    = (known after apply)
    }

  # module.repo_core_platform.github_branch_default.set_default_branch will be created
  + resource "github_branch_default" "set_default_branch" {
      + branch     = "master"
      + id         = (known after apply)
      + repository = "core-platform"
    }

  # module.repo_core_platform.github_branch_protection.protect_default_branch will be created
  + resource "github_branch_protection" "protect_default_branch" {
      + allows_deletions        = false
      + allows_force_pushes     = false
      + enforce_admins          = true
      + id                      = (known after apply)
      + pattern                 = "master"
      + repository_id           = (known after apply)
      + require_signed_commits  = false
      + required_linear_history = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
          + restrict_dismissals             = false
        }

      + required_status_checks {
          + strict = false
        }
    }

  # module.repo_core_platform.github_repository.the_repository will be created
  + resource "github_repository" "the_repository" {
      + allow_auto_merge       = true
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archive_on_destroy     = false
      + archived               = false
      + auto_init              = false
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Some core platform code and stuff"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + name                   = "core-platform"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
      + vulnerability_alerts   = true
    }

  # module.repo_github_configuration.github_branch.default will be created
  + resource "github_branch" "default" {
      + branch        = "master"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "github-configuration"
      + sha           = (known after apply)
      + source_branch = "master"
      + source_sha    = (known after apply)
    }

  # module.repo_github_configuration.github_branch_default.set_default_branch will be created
  + resource "github_branch_default" "set_default_branch" {
      + branch     = "master"
      + id         = (known after apply)
      + repository = "github-configuration"
    }

  # module.repo_github_configuration.github_branch_protection.protect_default_branch will be created
  + resource "github_branch_protection" "protect_default_branch" {
      + allows_deletions        = false
      + allows_force_pushes     = false
      + enforce_admins          = true
      + id                      = (known after apply)
      + pattern                 = "master"
      + repository_id           = "github-configuration"
      + require_signed_commits  = false
      + required_linear_history = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
          + restrict_dismissals             = false
        }

      + required_status_checks {
          + contexts = [
              + "Terraform",
            ]
          + strict   = false
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @kdmccormick, Action: `pull_request`*